#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_function_with_docker_build.data.aws_caller_identity.current: Reading...
data.aws_ecr_authorization_token.token: Reading...
module.lambda_function_with_docker_build.data.aws_iam_policy_document.assume_role[0]: Reading...
module.docker_build.data.aws_caller_identity.this: Reading...
module.lambda_function_with_docker_build.data.aws_region.current: Reading...
data.aws_region.current: Reading...
module.docker_build.aws_ecr_repository.this[0]: Refreshing state... [id=python-awslambda-template]
data.aws_caller_identity.this: Reading...
module.lambda_function_with_docker_build.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/python-awslambda-template]
module.lambda_function_with_docker_build.data.aws_partition.current: Reading...
module.lambda_function_with_docker_build.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_function_with_docker_build.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.lambda_function_with_docker_build.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.docker_build.data.aws_region.current: Reading...
module.docker_build.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_function_with_docker_build.aws_iam_role.lambda[0]: Refreshing state... [id=python-awslambda-template]
module.docker_build.data.aws_caller_identity.this: Read complete after 0s [id=944523251195]
data.aws_caller_identity.this: Read complete after 0s [id=944523251195]
module.lambda_function_with_docker_build.data.aws_caller_identity.current: Read complete after 0s [id=944523251195]
data.aws_ecr_authorization_token.token: Read complete after 0s [id=us-east-1]
module.docker_build.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=python-awslambda-template]
module.docker_build.docker_image.this: Refreshing state... [id=sha256:6f2b1a2f80f15b34a63f0e728afae0d1f03edc262e2fe03bae07a334c215f952944523251195.dkr.ecr.us-east-1.amazonaws.com/python-awslambda-template]
module.docker_build.docker_registry_image.this: Refreshing state... [id=sha256:e9373e4859836b5604215607b167fd116a8cd547da5e3c5c3a7d887f84260eae]
module.lambda_function_with_docker_build.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::944523251195:policy/python-awslambda-template-logs]
module.lambda_function_with_docker_build.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=python-awslambda-template-20240507104911174600000001]
module.lambda_function_with_docker_build.aws_lambda_function.this[0]: Refreshing state... [id=python-awslambda-template]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.docker_build.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:6f2b1a2f80f15b34a63f0e728afae0d1f03edc262e2fe03bae07a334c215f952944523251195.dkr.ecr.us-east-1.amazonaws.com/python-awslambda-template"
      - image_id     = "sha256:6f2b1a2f80f15b34a63f0e728afae0d1f03edc262e2fe03bae07a334c215f952" -> null
      - name         = "944523251195.dkr.ecr.us-east-1.amazonaws.com/python-awslambda-template" -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.docker_build.aws_ecr_lifecycle_policy.this[0] must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "this" {
      ~ id          = "python-awslambda-template" -> (known after apply)
      ~ registry_id = "944523251195" -> (known after apply)
      ~ repository  = "python-awslambda-template" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.docker_build.aws_ecr_repository.this[0] must be replaced
+/- resource "aws_ecr_repository" "this" {
      ~ arn                  = "arn:aws:ecr:us-east-1:944523251195:repository/python-awslambda-template" -> (known after apply)
      ~ id                   = "python-awslambda-template" -> (known after apply)
      ~ name                 = "python-awslambda-template" -> "abc" # forces replacement
      ~ registry_id          = "944523251195" -> (known after apply)
      ~ repository_url       = "944523251195.dkr.ecr.us-east-1.amazonaws.com/python-awslambda-template" -> (known after apply)
      - tags                 = {
          - "created" = "2024-05-07T10:49:06Z"
          - "project" = "python-awslambda-template"
        } -> null
      ~ tags_all             = {
          - "created" = "2024-05-07T10:49:06Z"
          - "project" = "python-awslambda-template"
        } -> (known after apply)
        # (2 unchanged attributes hidden)

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.docker_build.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = (known after apply)
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "2e799a20a68700b836304d3c0dd615d79a6e8516"
        }

      + build {
          + cache_from   = []
          + context      = "../"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + platform     = "linux/amd64"
          + remove       = true
          + security_opt = []
          + tag          = []
        }
    }

  # module.docker_build.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:e9373e4859836b5604215607b167fd116a8cd547da5e3c5c3a7d887f84260eae" -> (known after apply)
      ~ name                 = "944523251195.dkr.ecr.us-east-1.amazonaws.com/python-awslambda-template" # forces replacement -> (known after apply) # forces replacement
      ~ sha256_digest        = "sha256:e9373e4859836b5604215607b167fd116a8cd547da5e3c5c3a7d887f84260eae" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.lambda_function_with_docker_build.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.lambda_function_with_docker_build.aws_cloudwatch_log_group.lambda[0] must be replaced
+/- resource "aws_cloudwatch_log_group" "lambda" {
      ~ arn               = "arn:aws:logs:us-east-1:944523251195:log-group:/aws/lambda/python-awslambda-template" -> (known after apply)
      ~ id                = "/aws/lambda/python-awslambda-template" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/python-awslambda-template" -> "/aws/lambda/abc" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {
          - "created" = "2024-05-07T10:49:06Z"
          - "project" = "python-awslambda-template"
        } -> null
      ~ tags_all          = {
          - "created" = "2024-05-07T10:49:06Z"
          - "project" = "python-awslambda-template"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.lambda_function_with_docker_build.aws_iam_policy.logs[0] must be replaced
+/- resource "aws_iam_policy" "logs" {
      ~ arn              = "arn:aws:iam::944523251195:policy/python-awslambda-template-logs" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ id               = "arn:aws:iam::944523251195:policy/python-awslambda-template-logs" -> (known after apply)
      ~ name             = "python-awslambda-template-logs" -> "abc-logs" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:944523251195:log-group:/aws/lambda/python-awslambda-template:*:*",
                          - "arn:aws:logs:us-east-1:944523251195:log-group:/aws/lambda/python-awslambda-template:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id        = "ANPA5X2PZBX53PPEKPZTG" -> (known after apply)
      - tags             = {
          - "created" = "2024-05-07T10:49:06Z"
          - "project" = "python-awslambda-template"
        } -> null
      ~ tags_all         = {
          - "created" = "2024-05-07T10:49:06Z"
          - "project" = "python-awslambda-template"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.lambda_function_with_docker_build.aws_iam_role.lambda[0] must be replaced
+/- resource "aws_iam_role" "lambda" {
      ~ arn                   = "arn:aws:iam::944523251195:role/python-awslambda-template" -> (known after apply)
      ~ create_date           = "2024-05-07T10:49:10Z" -> (known after apply)
      ~ id                    = "python-awslambda-template" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::944523251195:policy/python-awslambda-template-logs",
        ] -> (known after apply)
      ~ name                  = "python-awslambda-template" -> "abc" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {
          - "created" = "2024-05-07T10:49:06Z"
          - "project" = "python-awslambda-template"
        } -> null
      ~ tags_all              = {
          - "created" = "2024-05-07T10:49:06Z"
          - "project" = "python-awslambda-template"
        } -> (known after apply)
      ~ unique_id             = "AROA5X2PZBX5UNHK4YYZ3" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function_with_docker_build.aws_iam_role_policy_attachment.logs[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "logs" {
      ~ id         = "python-awslambda-template-20240507104911174600000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::944523251195:policy/python-awslambda-template-logs" # forces replacement -> (known after apply) # forces replacement
      ~ role       = "python-awslambda-template" -> "abc" # forces replacement
    }

  # module.lambda_function_with_docker_build.aws_lambda_function.this[0] must be replaced
+/- resource "aws_lambda_function" "this" {
      ~ arn                            = "arn:aws:lambda:us-east-1:944523251195:function:python-awslambda-template" -> (known after apply)
      ~ function_name                  = "python-awslambda-template" -> "abc" # forces replacement
      ~ id                             = "python-awslambda-template" -> (known after apply)
      ~ image_uri                      = "944523251195.dkr.ecr.us-east-1.amazonaws.com/python-awslambda-template@sha256:e9373e4859836b5604215607b167fd116a8cd547da5e3c5c3a7d887f84260eae" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:944523251195:function:python-awslambda-template/invocations" -> (known after apply)
      ~ last_modified                  = "2024-05-07T10:52:50.425+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:944523251195:function:python-awslambda-template:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:944523251195:function:python-awslambda-template:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::944523251195:role/python-awslambda-template" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "e9373e4859836b5604215607b167fd116a8cd547da5e3c5c3a7d887f84260eae" -> (known after apply)
      ~ source_code_size               = 0 -> (known after apply)
      - tags                           = {
          - "created" = "2024-05-07T10:49:06Z"
          - "project" = "python-awslambda-template"
        } -> null
      ~ tags_all                       = {
          - "created" = "2024-05-07T10:49:06Z"
          - "project" = "python-awslambda-template"
        } -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ logging_config {
          ~ log_group  = "/aws/lambda/python-awslambda-template" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 9 to add, 0 to change, 8 to destroy.

Changes to Outputs:
  + test = "/home/runner/work/python-awslambda-template/python-awslambda-template"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @xtutran, Action: `pull_request`*